<!DOCTYPE html>
<html lang="es">
<head>
	<title>P&aacute;gina principal de fin de curso</title>
	<meta charset="utf-8">
	<meta name="Pablo P. Palacio">
	<link rel="stylesheet" type="text/css" href="Trabajo final.css">
	<meta name="viewport" content="width=device-width, initial-scale=1.0">
	<link href="Principal.xml" type="xml">
</head>
<body>
	<form method=get action="http://www.google.es/search" target="_blank" id="buscar">
		<input type="search" name="google">
		<input type="submit" id="button">
	</form>
	<p><h1>Por f&iacute;n se acaba el curso</h1></p>
	<!--Al principio una barra lateral-->
	<aside id="lateral">Esto es un tipo de p&aacute;rrafo especial, que se coloca de manera vertical al lado del texto principal. Aqu&iacute; podr&iacute;an ir noticias de &uacute;ltima hora, e incluso nuestras redes sociales en caso de tenerlas.
	<br>
	<!--En este apartado se han puesto las redes sociales más conocidas y su link a la página web oficial.-->
	<div id="lateral">
		<span id="Whatsapp"><a href="https://web.whatsapp.com/" target="_blank">Whatsapp</a></span>

		<br><span id="Facebook"><a href="https://facebook.com/" target="_blank">Facebook</a></span>

		<br><span id="Twitter"><a href="https://twitter.com/" target="_blank">Twitter</a></span>

		<br><span id="Instagram"><a href="https://instagram.com/" target="_blank"><image>Instagram</a></span>

		<br><span id="TikTok"><a href="https://tiktok.com/" target="_blank">TikTok</a></span>

		<br><span id="Youtube"><a href="https://youtube.com/" target="_blank">Youtube</a></span>

		<br><span id="Twitch"><a href="https://twitch.tv/" target="_blank">
			<img src="twitch.jpg" alt="Twitch" id="extra">
		</a></span>
		</aside>
	</div>
	</aside>
	<div id="cabeza">
		<p>Durante este a&ntilde;o he aprendido distintas maneras de crear mi propia p&aacute;gina web con html y aqu&iacute; voy a mostar como se crea una, y que cosas puede tener la p&aacute;gina.</p>
		<p>Para crear una p&aacute;gina hay que seguir unos requisitos b&aacute;sicos como que est&eacute; bien formada y que tenga unas normas b&aacute;sicas.</p>
		<p>Las p&aacute;ginas web de cualquier sitio, est&aacute;n formadas por html, css y javascript entre otras muchas cosas. De momento en este curso solo he aprendido <a href="https://www.w3schools.com/html/default.asp" target="_blank">html</a>, <a href="https://www.w3schools.com/css/default.asp" target="_blank">css</a> y <a href="https://www.w3schools.com/xml/default.asp">xml</a> y esto es lo que voy a demostar en esta p&aacute;gina web.</p>
		<p>Puede parecer a simple vista que esta p&aacute;gina web es muy sencilla, pero lo m&aacute;s complicado es poder y saber poner una barra lateral a la derecha del texto principal, e insertar un cuadro de b&uacute;squeda que lleve directamente a google o a otro navegador, y conseguir que al abrir una p&aacute;gina desde otro dispositivo distinto al del origen, esta se adapte al nuevo dispositivo desde el cual se abre y los problemas que genera no sean muy evidentes.</p>
	</div>
	<br>
	<a href="Principal.xml">
		<img src="naruto.jpg" alt="P&aacute;gina extra" id="extra">
	</a>

	<a href="https://google.com/" target="_blank" >
		<img src="google.jpg" alt="Google" id="google">
	</a>

	<a href="https://wikipedia.org/" target="_blank">
		<img src="wiki.jpg" alt="Wikipedia" id="extra">
	</a>

	<a href="https://wikipedia.org/" target="_blank">
		<img src="wiki.jpg" alt="Wikipedia" id="extra">
	</a>

	<a href="https://google.com/" target="_blank" >
		<img src="google.jpg" alt="Google" id="google">
	</a>

	<a href="Principal.xml">
		<img src="naruto.jpg" alt="P&aacute;gina extra" id="extra">
	</a>
	<br>
	<br>
	<br>
	<br>
	<br>
	<div id="cuerpo">
		<p>Para poder crear una p&aacute;gina web atractiva a la vista del lector, hay que a&ntilde;adirle distintos estilos, y saber de antemano de que va a tratar la web.</p>
		<p>En mi caso, solo voy a explicar un poco por encima como se crear&iacute;a una p&aacute;gina web, y como se podr&iacute;an enlazar dos o m&aacute;s p&aacute;ginas web dentro de un mismo documento html.</p>
		<p>Esta p&aacute;gina es muy <a href="https://www.google.com/search?q=escueta&oq=escueta&aqs=chrome..69i57j0l9.7299j1j7&sourceid=chrome&ie=UTF-8" target="_blank">escueta</a>, ya que lo &uacute;nico que quer&iacute;a hacer con ella era meterle todo el css posible con algo de html, y meter im&aacute;genes que redireccionaran a los usuarios a otros p&aacute;ginas web. Una de ellas la he creado yo, y la otras son google y wikipedia.</p>
		<p>Para acceder a la que he creado, hay que hacer click en el primer icono de los tres que aparecen en la parte superior de este segundo bloque. La segunda imagen, lleva directamente a la p&aacute;gina inicial de google y la &uacute;ltima lleva a wikipedia (WK). Aunque aparezca el simbolo de Firefox, si se selecciona esa opci&oacute;n, se abrir&aacute; una nueva pesta&ntilde;a con google.</p>
	</div>
	<br>
	<div id="leveling">
		<p>Como se puede observar por el fondo de pantalla, me gusta bastante el anime, y el manga y todo lo relacionado con el g&eacute;nero "otaku".
		Hace poco me encontr&eacute; con una de las p&aacute;ginas de mangas (mencionadas anteriormente) y me empec&eacute; a leer uno de los mangas m&aacute;s top que hab&iacute;a en ese momento llamado "Solo Leveling".
		</p>
		<p>
		<a href="http://www.mangareader.cc/manga/solo-leveling/" target="_blanc"><img src="leveling.png" alt="Solo Leveling"></a>
		
		<a href="http://www.mangareader.cc/manga/solo-leveling/" target="_blanc" id="derecha"><img src="leveling.png" alt="Solo Leveling"></a>
		</p>
		<p>
		La calidad del manga es increible, est&aacute; a todo color, y se ha rumoreado que posiblemente se haga una adaptaci&oacute;n al manga pero son solo rumores. Personalmente, me gustar&iacute;a que la adaptaran pero creo que a todas las compa&ntilde;&iacute;as les ser&iacute;a muy dif&iacute;cil adaptar una calidad de imagen tan buena al anime.
		</p>
	</div>
	<br>
	<br>
	<div id="pie">
		<span class="nombre">Pablo P. Palacio</span>
		<span class="copyright">
			Curso 2020&nbsp;-&nbsp;2021
		</span>
	</div>
</body>
</html>
<!--
div
icono
-->